benchmark/test-async.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test-async
Document Length:        4 bytes

Concurrency Level:      50
Time taken for tests:   1005.818 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      128000 bytes
Total body sent:        160000
HTML transferred:       4000 bytes
Requests per second:    0.99 [#/sec] (mean)
Time per request:       50290.880 [ms] (mean)
Time per request:       1005.818 [ms] (mean, across all concurrent requests)
Transfer rate:          0.12 [Kbytes/sec] received
                        0.16 kb/s sent
                        0.28 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:  2008 49011 4863.8  50190   52169
Waiting:     2004 49010 4863.9  50189   52169
Total:       2008 49011 4863.4  50190   52170

Percentage of the requests served within a certain time (ms)
  50%  50190
  66%  50194
  75%  50198
  80%  50201
  90%  50205
  95%  50209
  98%  50211
  99%  50213
 100%  52170 (longest request)