benchmark/test-async2.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test-async2
Document Length:        4 bytes

Concurrency Level:      50
Time taken for tests:   43.226 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      128000 bytes
Total body sent:        161000
HTML transferred:       4000 bytes
Requests per second:    23.13 [#/sec] (mean)
Time per request:       2161.308 [ms] (mean)
Time per request:       43.226 [ms] (mean, across all concurrent requests)
Transfer rate:          2.89 [Kbytes/sec] received
                        3.64 kb/s sent
                        6.53 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:  2002 2020 101.2   2009    3029
Waiting:     2002 2020 101.2   2009    3029
Total:       2002 2020 101.3   2009    3030

Percentage of the requests served within a certain time (ms)
  50%   2009
  66%   2011
  75%   2012
  80%   2014
  90%   2018
  95%   2022
  98%   2031
  99%   3019
 100%   3030 (longest request)